class ChatService() {


//    TODO Видеть, сколько чатов не прочитано.
//    TODO Получить список чатов (например, service.getChats).
//    TODO Получить список последних сообщений из чатов (можно в виде списка строк). Если сообщений в чате нет (все были удалены), то пишется «нет сообщений».
//    TODO Получить список сообщений из чата, указав: ID чата; ID последнего сообщения, начиная с которого нужно подгрузить более новые;После того как вызвана эта функция, все отданные сообщения автоматически считаются прочитанными.
//    TODO Создать новое сообщение.
//    TODO Удалить сообщение.
//    TODO Создать чат. Чат создаётся, когда пользователю отправляется первое сообщение.
//    TODO Удалить чат, т. е. целиком удалить всю переписку.
}//Возможности для пользователя: